## Plan Result (ithc_frontendappgateway)




<pre><code>Plan: 0 to add, 2 to change, 0 to destroy.</code></pre>

* Update
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
        id                                = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw"
        name                              = "cft-aks-fe-00-ithc-agw"
        tags                              = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "Medium"
            "environment"  = "ithc"
            "startupMode"  = "always"
        }
        # (7 unchanged attributes hidden)

      - backend_address_pool {
          - fqdns        = [] -> null
          - id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/idam-web-admin" -> null
          - ip_addresses = [
              - "10.11.207.250",
              - "10.11.223.250",
            ] -> null
          - name         = "idam-web-admin" -> null
        }

      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/adoption-web" -> null
          - name                                = "adoption-web" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/adoption-web" -> null
          - probe_name                          = "adoption-web" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/bar" -> null
          - name                                = "bar" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/bar" -> null
          - probe_name                          = "bar" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/cft-api-mgmt" -> null
          - name                                = "cft-api-mgmt" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/cft-api-mgmt" -> null
          - probe_name                          = "cft-api-mgmt" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/civil-citizen-ui" -> null
          - name                                = "civil-citizen-ui" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/civil-citizen-ui" -> null
          - probe_name                          = "civil-citizen-ui" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/cmc" -> null
          - name                                = "cmc" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/cmc" -> null
          - probe_name                          = "cmc" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/cmc-legal" -> null
          - name                                = "cmc-legal" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/cmc-legal" -> null
          - probe_name                          = "cmc-legal" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/cui-ra" -> null
          - name                                = "cui-ra" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/cui-ra" -> null
          - probe_name                          = "cui-ra" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/div-da" -> null
          - name                                = "div-da" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/div-da" -> null
          - probe_name                          = "div-da" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/div-dn" -> null
          - name                                = "div-dn" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/div-dn" -> null
          - probe_name                          = "div-dn" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/div-pfe" -> null
          - name                                = "div-pfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/div-pfe" -> null
          - probe_name                          = "div-pfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/div-rfe" -> null
          - name                                = "div-rfe" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/div-rfe" -> null
          - probe_name                          = "div-rfe" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/dss-update-case" -> null
          - name                                = "dss-update-case" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/dss-update-case" -> null
          - probe_name                          = "dss-update-case" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/et-pet-admin" -> null
          - name                                = "et-pet-admin" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/et-pet-admin" -> null
          - probe_name                          = "et-pet-admin" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/et-pet-et1" -> null
          - name                                = "et-pet-et1" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/et-pet-et1" -> null
          - probe_name                          = "et-pet-et1" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/et-pet-et3" -> null
          - name                                = "et-pet-et3" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/et-pet-et3" -> null
          - probe_name                          = "et-pet-et3" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/et-sya" -> null
          - name                                = "et-sya" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/et-sya" -> null
          - probe_name                          = "et-sya" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/fact" -> null
          - name                                = "fact" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/fact" -> null
          - probe_name                          = "fact" -> null
          - protocol                            = "Http" -> null
          - request_timeout                     = 30 -> null
          - trusted_root_certificate_names      = [] -> null
        }
      - backend_http_settings {
          - cookie_based_affinity               = "Disabled" -> null
          - id                                  = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/fact-admin" -> null
          - name                                = "fact-admin" -> null
          - pick_host_name_from_backend_address = false -> null
          - port                                = 80 -> null
          - probe_id                            = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/probes/fact-admin" -> null
          - probe_na

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-register-org"
          + name                       = "xui-register-org"
          + priority                   = 200
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendAddressPools/xui-webapp"
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/backendHttpSettingsCollection/xui-webapp"
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/httpListeners/xui-webapp"
          + http_listener_name         = "xui-webapp"
          + id                         = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/requestRoutingRules/xui-webapp"
          + name                       = "xui-webapp"
          + priority                   = 210
          + rewrite_rule_set_id        = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw/rewriteRuleSets/x_fwded_proto"
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "adoption-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "adoption-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "adoption-web"
          + id                         = (known after apply)
          + name                       = "adoption-web"
          + priority                   = 320
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "cft-api-mgmt"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "cft-api-mgmt"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "cft-api-mgmt"
          + id                         = (known after apply)
          + name                       = "cft-api-mgmt"
          + priority                   = 350
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "cui-ra"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "cui-ra"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "cui-ra"
          + id                         = (known after apply)
          + name                       = "cui-ra"
          + priority                   = 460
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "dss-update-case"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "dss-update-case"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "dss-update-case"
          + id                         = (known after apply)
          + name                       = "dss-update-case"
          + priority                   = 410
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-pet-admin"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-pet-admin"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-pet-admin"
          + id                         = (known after apply)
          + name                       = "et-pet-admin"
          + priority                   = 450
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-pet-et1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-pet-et1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-pet-et1"
          + id                         = (known after apply)
          + name                       = "et-pet-et1"
          + priority                   = 430
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-pet-et3"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-pet-et3"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-pet-et3"
          + id                         = (known after apply)
          + name                       = "et-pet-et3"
          + priority                   = 440
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "et-sya"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "et-sya"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "et-sya"
          + id                         = (known after apply)
          + name                       = "et-sya"
          + priority                   = 380
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "help-with-fees-publicapp"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "help-with-fees-publicapp"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "help-with-fees-publicapp"
          + id                         = (known after apply)
          + name                       = "help-with-fees-publicapp"
          + priority                   = 480
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "help-with-fees-staffapp"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "help-with-fees-staffapp"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "help-with-fees-staffapp"
          + id                         = (known after apply)
          + name                       = "help-with-fees-staffapp"
          + priority                   = 470
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "hmi-apim"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "hmi-apim"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "hmi-apim"
          + id                         = (known after apply)
          + name                       = "hmi-apim"
          + priority                   = 340
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "idam-user-dashboard"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "idam-user-dashboard"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "idam-user-dashboard"
          + id                         = (known after apply)
          + name                       = "idam-user-dashboard"
          + priority                   = 290
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "paymentoutcome-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "paymentoutcome-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "paymentoutcome-web"
          + id                         = (known after apply)
          + name                       = "paymentoutcome-web"
          + priority                   = 360
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum"
          + id                         = (known after apply)
          + name                       = "plum"
          + priority                   = 370
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "privatelaw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "privatelaw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "privatelaw"
          + id                         = (known after apply)
          + name                       = "privatelaw"
          + priority                   = 330
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-dss-update-case-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-dss-update-case-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-dss-update-case-web"
          + id                         = (known after apply)
          + name                       = "sptribs-dss-update-case-web"
          + priority                   = 400
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sptribs-frontend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sptribs-frontend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sptribs-frontend"
          + id                         = (known after apply)
          + name                       = "sptribs-frontend"
          + priority                   = 390
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-cor"
          + id                         = (known after apply)
          + name                       = "sscs-cor"
          + priority                   = 310
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tribunals"
          + id                         = (known after apply)
          + name                       = "sscs-tribunals"
          + priority                   = 300
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "tax-tribunals-datacapture"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "tax-tribunals-datacapture"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "tax-tribunals-datacapture"
          + id                         = (known after apply)
          + name                       = "tax-tribunals-datacapture"
          + priority                   = 420
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

        # (56 unchanged blocks hidden)
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostics_access_logs_sa[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "diagnostics_access_logs_sa" {
        id                             = "/subscriptions/62864d44-5da9-4ae9-89e7-0cf33942fa09/resourceGroups/cft-ithc-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks-fe-00-ithc-agw|app-gw-storage-account"
        name                           = "app-gw-storage-account"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (5 unchanged blocks hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":2025,"Program":"tfcmt","SHA1":"","Target":"ithc_frontendappgateway","Vars":{}} -->